tests/performance/load.yml
config:
  target: "{{ $processEnvironment.API_URL }}"
  environments:
    production:
      target: "{{ $processEnvironment.API_URL }}"
    testing:
      target: "{{ $processEnvironment.API_URL }}"
    local:
      target: "http://127.0.0.1:3000"
  ensure:
    thresholds:
      # p99 of response time must be <250:
      - "http.response_time.p99": 250
      # p95 of response time must be <100:
      - "http.response_time.p95": 100
  payload:
    path: "./books50.csv"
    fields:
      - "title"
      - "authors"
      - "isbn"
      # - "pages"// TODO: check how to handle cast (int)
      - "publisher"
    order: "sequential"
    skipHeader: true
    cast: false
  phases:
    - name: "Warm up API"
      duration: 60
      arrivalRate: 5
      rampTo: 10
    - name: "Ramp up to peak load"
      duration: 60
      arrivalRate: 10
      rampTo: 50
    - name: "Sustain peak load"
      duration: 300
      rampTo: 50
    - name: "Ramp down to zero"
      duration: 60
      arrivalRate: 50
      rampTo: 0
scenarios:
  - flow:
    - post:
        url: "/books"
        headers:
          Content-Type: "application/json"
        json:
          title: "{{ title }}"
          authors: "{{ authors }}"
          isbn: "{{ isbn }}"
          # pages: "{{ pages }}"
          publisher: "{{ publisher }}"
        expect:
          statusCode: 201
          contentType: application/json
          hasProperty: "id"