tests/performance/load.yml
config:
  plugins:
    ensure: {}
    expect: {}
  target: "{{ $processEnvironment.API_URL }}"
  phases:
    - name: "Sustain 10 RPS for 5 minutes"
      duration: 300
      arrivalRate: 10
      maxVusers: 10
  processor: "./generator.js"
  default:
    headers:
      Accept: "application/json"
      Content-Type: "application/json"
  ensure:
    maxErrorRate: 1
scenarios:
  - name: "Create, List, Read, Delete"
    flow:
      - function: "generateRandomData"
      - post:
          url: "/books"
          json:
            title: "{{ title }}"
            authors: "{{ authors }}"
            isbn: "{{ isbn }}"
            pages: "{{ pages }}"
            publisher: "{{ publisher }}"
          expect:
            statusCode: 201
            hasProperty: "id"
      - think: 1
      - get:
          url: "/books"
          expect:
            statusCode: 200
          capture:
            json: "$.books[*].id"
            as: "id"
      - think: 1
      - get:
          url: "/books/{{ id }}"
          expect:
            statusCode: 200
      - think: 1
      - delete:
          url: "/books/{{ id }}"
          expect:
            statusCode: 204