tests/performance/slo.yml
config:
  plugins:
    ensure: {}
    expect: {}
  environments:
    # Reported value should be closed to 5 RPS target
    slo30sec5vus:
      target: "{{ $processEnvironment.API_URL }}"
      phases:
        - name: "Service Level Objective 5 RPS"
          duration: 30
          arrivalRate: 5
          maxVusers: 5
    # Reported value should be closed to 10 RPS target
    slo30sec10vus:
      target: "{{ $processEnvironment.API_URL }}"
      phases:
        - name: "Service Level Objective 10 RPS"
          duration: 30
          arrivalRate: 10
          maxVusers: 10
    # Reported value should be closed to 15 RPS target
    slo30sec15vus:
      target: "{{ $processEnvironment.API_URL }}"
      phases:
        - name: "Service Level Objective 15 RPS"
          duration: 30
          arrivalRate: 15
          maxVusers: 15
  processor: "./generator.js"
  default:
    headers:
      Accept: "application/json"
      Content-Type: "application/json"
  ensure:
    # p95: 600  # TODO: Determine baseline values before setting this check
    maxErrorRate: 1
scenarios:
  - name: "Create, List, Read, Delete"
    flow:
      - function: "generateRandomData"
      - post:
          url: "/books"
          json:
            title: "{{ title }}"
            authors: "{{ authors }}"
            isbn: "{{ isbn }}"
            pages: "{{ pages }}"
            publisher: "{{ publisher }}"
          expect:
            statusCode: 201
            hasProperty: "id"
      - think: 1
      - get:
          url: "/books"
          expect:
            statusCode: 200
          capture:
            json: "$.books[*].id"
            as: "id"
      - think: 1
      - get:
          url: "/books/{{ id }}"
          expect:
            statusCode: 200
      - think: 1
      - delete:
          url: "/books/{{ id }}"
          expect:
            statusCode:
              - 204